{"batch_number":2,"scenes":"11-20","frames":[{"frame_id":"frame_011","description":"The pack of prehistoric hyenas continues their desperate run across the ash-dusted savanna, their eyes wide with fear as the sky darkens further."},{"frame_id":"frame_012","description":"A wider shot shows the hyenas as small figures against the vast, desolate landscape, with the erupting volcano now partially obscured by dense smoke and falling ash."},{"frame_id":"frame_013","description":"Close-up on a lead hyena, its fur already lightly coated with ash, panting heavily as it glances back towards the menacing volcano before pushing forward."},{"frame_id":"frame_014","description":"The sky above the savanna transforms into an ominous, dark grey, as a massive cloud of volcanic ash completely blots out the sun."},{"frame_id":"frame_015","description":"Heavy ash begins to fall like snow, quickly covering the ground, trees, and animals, reducing visibility to a hazy, suffocating gloom."},{"frame_id":"frame_016","description":"A lone, gnarled prehistoric tree stands starkly against the ash-choked sky, its branches brittle and bare, symbolizing the widespread destruction."},{"frame_id":"frame_017","description":"A chaotic stampede of various prehistoric herbivores – mammoths, woolly rhinos, and giant deer – thunders through the ash, also fleeing the catastrophe."},{"frame_id":"frame_018","description":"The hyenas are now caught amidst this larger, panicked migration, darting between the legs of the colossal animals, trying to avoid being crushed."},{"frame_id":"frame_019","description":"A young mammoth calf struggles to keep pace with its mother through the deepening ash, its tiny trumpets lost in the din of the stampede."},{"frame_id":"frame_020","description":"Close-up on the distressed, wise eyes of the mother mammoth, trumpeting loudly and desperately nudging her calf forward through the chaos."},{"frame_id":"frame_021","description":"The ground trembles violently, sending tremors through the fleeing herds, causing fresh cracks to spiderweb across the ash-covered earth."},{"frame_id":"frame_022","description":"The stampede intensifies, a swirling vortex of ash, dust, and terrified bodies, as the ground continues to shake underfoot."},{"frame_id":"frame_023","description":"The hyenas frantically weave through the powerful legs of the stampeding herbivores, narrowly dodging hooves and tusks, their agility their only defense."},{"frame_id":"frame_024","description":"One hyena stumbles and falls in the deep ash, rolling briefly before scrambling back to its feet with a desperate yelp, rejoining the pack."},{"frame_id":"frame_025","description":"The pack struggles to maintain cohesion, their calls to each other muffled by the roar of the eruption and the thunder of the stampede."},{"frame_id":"frame_026","description":"A new, terrifying threat emerges: a river of glowing, molten lava begins to snake across the landscape, cutting off one of the main escape routes."},{"frame_id":"frame_027","description":"The intense heat haze shimmers above the advancing lava, distorting the panicked animals fleeing in the distance as the fiery flow rapidly spreads."},{"frame_id":"frame_028","description":"The hyenas abruptly halt, catching sight of the menacing lava flow, and with renewed panic, instinctively change direction, seeking another path."},{"frame_id":"frame_029","description":"The pack scrambles desperately up a steep, rocky incline, their claws scrabbling for purchase, just as the leading edge of the viscous lava creeps below them."},{"frame_id":"frame_030","description":"A hyena glances back from the incline, its face illuminated by the eerie, orange glow of the lava, which is now only a few feet from their tails."},{"frame_id":"frame_031","description":"They reach the top of the ridge, panting heavily, watching the unstoppable river of fire flow below, temporarily safe but now on a precarious island."},{"frame_id":"frame_032","description":"The sky is now a pitch black, completely overwhelmed by the volcanic ash and smoke, creating an apocalyptic, eternal night."},{"frame_id":"frame_033","description":"The landscape below is a desolate, grey wasteland, visibility severely reduced, with only the faint, distant glow of lava providing any light."},{"frame_id":"frame_034","description":"The hyenas huddle together on the rocky outcrop, their forms barely visible in the oppressive gloom, tiny survivors against the vastness of the cataclysm."},{"frame_id":"frame_035","description":"The lead hyena cautiously scouts the rocky terrain, its nose twitching, eventually discovering a small, shallow cave or overhang in the rock face."},{"frame_id":"frame_036","description":"The pack cautiously enters the makeshift shelter, seeking refuge from the relentless ashfall and the biting, ash-laden wind."},{"frame_id":"frame_037","description":"Inside the shallow cave, they huddle together, still exposed to the elements but somewhat protected from the immediate onslaught, their bodies pressed for warmth."},{"frame_id":"frame_038","description":"Close-up on the eyes of a hyena, gleaming nervously in the near total darkness, reflecting the faint, distant, flickering orange glow from the eruption."},{"frame_id":"frame_039","description":"The sounds of the eruption – distant rumbling, occasional explosions, and the crackling of the lava flow – are muffled but still a constant, terrifying presence."},{"frame_id":"frame_040","description":"The hyenas rest uneasily, their bodies tense, ears twitching at every sound, knowing that the danger is far from over, awaiting a dawn that may never come."}],"video_clips":[{"video_clip_id":"video_clip_011","start_frame":"frame_011","end_frame":"frame_013","description":"The hyenas continue their frantic flight, increasingly enveloped by falling ash and the darkening sky."},{"video_clip_id":"video_clip_012","start_frame":"frame_014","end_frame":"frame_016","description":"The sky darkens completely with ash, turning day into night, and the landscape becomes a desolate, ash-covered wasteland."},{"video_clip_id":"video_clip_013","start_frame":"frame_017","end_frame":"frame_019","description":"A massive stampede of prehistoric herbivores joins the desperate flight, creating a chaotic and dangerous environment for the hyenas."},{"video_clip_id":"video_clip_014","start_frame":"frame_020","end_frame":"frame_022","description":"The stampede intensifies with ground tremors, highlighting the widespread panic and the immense scale of the disaster."},{"video_clip_id":"video_clip_015","start_frame":"frame_023","end_frame":"frame_025","description":"The hyenas struggle to navigate through the legs of the stampeding giants, fighting to stay together and avoid being trampled."},{"video_clip_id":"video_clip_016","start_frame":"frame_026","end_frame":"frame_028","description":"A new threat appears: a river of glowing lava, forcing the hyenas to find another escape route."},{"video_clip_id":"video_clip_017","start_frame":"frame_029","end_frame":"frame_031","description":"The hyenas narrowly escape the advancing lava by scrambling up a rocky incline, finding temporary safety but facing a new predicament."},{"video_clip_id":"video_clip_018","start_frame":"frame_032","end_frame":"frame_034","description":"The world is plunged into complete darkness by the ash, transforming the landscape into a desolate, almost unrecognizable grey expanse."},{"video_clip_id":"video_clip_019","start_frame":"frame_035","end_frame":"frame_037","description":"The lead hyena finds a small cave, and the pack takes refuge from the ashfall and the oppressive darkness, huddled together."},{"video_clip_id":"video_clip_020","start_frame":"frame_038","end_frame":"frame_040","description":"The hyenas rest uneasily in their shelter, the sounds of the distant eruption a constant reminder that the danger is far from over."}]}